GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k80.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF45K80_INC_
#define _PIC18LF45K80_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18LF45K80
 */

/*
 * Device Registers
 */

// Register: RXERRCNT
#define RXERRCNT RXERRCNT
RXERRCNT                                 equ 0E41h
// bitfield definitions
RXERRCNT_REC_POSN                        equ 0000h
RXERRCNT_REC_POSITION                    equ 0000h
RXERRCNT_REC_SIZE                        equ 0008h
RXERRCNT_REC_LENGTH                      equ 0008h
RXERRCNT_REC_MASK                        equ 00FFh
RXERRCNT_REC0_POSN                       equ 0000h
RXERRCNT_REC0_POSITION                   equ 0000h
RXERRCNT_REC0_SIZE                       equ 0001h
RXERRCNT_REC0_LENGTH                     equ 0001h
RXERRCNT_REC0_MASK                       equ 0001h
RXERRCNT_REC1_POSN                       equ 0001h
RXERRCNT_REC1_POSITION                   equ 0001h
RXERRCNT_REC1_SIZE                       equ 0001h
RXERRCNT_REC1_LENGTH                     equ 0001h
RXERRCNT_REC1_MASK                       equ 0002h
RXERRCNT_REC2_POSN                       equ 0002h
RXERRCNT_REC2_POSITION                   equ 0002h
RXERRCNT_REC2_SIZE                       equ 0001h
RXERRCNT_REC2_LENGTH                     equ 0001h
RXERRCNT_REC2_MASK                       equ 0004h
RXERRCNT_REC3_POSN                       equ 0003h
RXERRCNT_REC3_POSITION                   equ 0003h
RXERRCNT_REC3_SIZE                       equ 0001h
RXERRCNT_REC3_LENGTH                     equ 0001h
RXERRCNT_REC3_MASK                       equ 0008h
RXERRCNT_REC4_POSN                       equ 0004h
RXERRCNT_REC4_POSITION                   equ 0004h
RXERRCNT_REC4_SIZE                       equ 0001h
RXERRCNT_REC4_LENGTH                     equ 0001h
RXERRCNT_REC4_MASK                       equ 0010h
RXERRCNT_REC5_POSN                       equ 0005h
RXERRCNT_REC5_POSITION                   equ 0005h
RXERRCNT_REC5_SIZE                       equ 0001h
RXERRCNT_REC5_LENGTH                     equ 0001h
RXERRCNT_REC5_MASK                       equ 0020h
RXERRCNT_REC6_POSN                       equ 0006h
RXERRCNT_REC6_POSITION                   equ 0006h
RXERRCNT_REC6_SIZE                       equ 0001h
RXERRCNT_REC6_LENGTH                     equ 0001h
RXERRCNT_REC6_MASK                       equ 0040h
RXERRCNT_REC7_POSN                       equ 0007h
RXERRCNT_REC7_POSITION                   equ 0007h
RXERRCNT_REC7_SIZE                       equ 0001h
RXERRCNT_REC7_LENGTH                     equ 0001h
RXERRCNT_REC7_MASK                       equ 0080h

// Register: TXERRCNT
#define TXERRCNT TXERRCNT
TXERRCNT                                 equ 0E42h
// bitfield definitions
TXERRCNT_TEC_POSN                        equ 0000h
TXERRCNT_TEC_POSITION                    equ 0000h
TXERRCNT_TEC_SIZE                        equ 0008h
TXERRCNT_TEC_LENGTH                      equ 0008h
TXERRCNT_TEC_MASK                        equ 00FFh
TXERRCNT_TEC0_POSN                       equ 0000h
TXERRCNT_TEC0_POSITION                   equ 0000h
TXERRCNT_TEC0_SIZE                       equ 0001h
TXERRCNT_TEC0_LENGTH                     equ 0001h
TXERRCNT_TEC0_MASK                       equ 0001h
TXERRCNT_TEC1_POSN                       equ 0001h
TXERRCNT_TEC1_POSITION                   equ 0001h
TXERRCNT_TEC1_SIZE                       equ 0001h
TXERRCNT_TEC1_LENGTH                     equ 0001h
TXERRCNT_TEC1_MASK                       equ 0002h
TXERRCNT_TEC2_POSN                       equ 0002h
TXERRCNT_TEC2_POSITION                   equ 0002h
TXERRCNT_TEC2_SIZE                       equ 0001h
TXERRCNT_TEC2_LENGTH                     equ 0001h
TXERRCNT_TEC2_MASK                       equ 0004h
TXERRCNT_TEC3_POSN                       equ 0003h
TXERRCNT_TEC3_POSITION                   equ 0003h
TXERRCNT_TEC3_SIZE                       equ 0001h
TXERRCNT_TEC3_LENGTH                     equ 0001h
TXERRCNT_TEC3_MASK                       equ 0008h
TXERRCNT_TEC4_POSN                       equ 0004h
TXERRCNT_TEC4_POSITION                   equ 0004h
TXERRCNT_TEC4_SIZE                       equ 0001h
TXERRCNT_TEC4_LENGTH                     equ 0001h
TXERRCNT_TEC4_MASK                       equ 0010h
TXERRCNT_TEC5_POSN                       equ 0005h
TXERRCNT_TEC5_POSITION                   equ 0005h
TXERRCNT_TEC5_SIZE                       equ 0001h
TXERRCNT_TEC5_LENGTH                     equ 0001h
TXERRCNT_TEC5_MASK                       equ 0020h
TXERRCNT_TEC6_POSN                       equ 0006h
TXERRCNT_TEC6_POSITION                   equ 0006h
TXERRCNT_TEC6_SIZE                       equ 0001h
TXERRCNT_TEC6_LENGTH                     equ 0001h
TXERRCNT_TEC6_MASK                       equ 0040h
TXERRCNT_TEC7_POSN                       equ 0007h
TXERRCNT_TEC7_POSITION                   equ 0007h
TXERRCNT_TEC7_SIZE                       equ 0001h
TXERRCNT_TEC7_LENGTH                     equ 0001h
TXERRCNT_TEC7_MASK                       equ 0080h

