GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k80.inc
// Register: B3D3
#define B3D3 B3D3
B3D3                                     equ 0EB9h
// bitfield definitions
B3D3_B3D3_POSN                           equ 0000h
B3D3_B3D3_POSITION                       equ 0000h
B3D3_B3D3_SIZE                           equ 0008h
B3D3_B3D3_LENGTH                         equ 0008h
B3D3_B3D3_MASK                           equ 00FFh
B3D3_B3D30_POSN                          equ 0000h
B3D3_B3D30_POSITION                      equ 0000h
B3D3_B3D30_SIZE                          equ 0001h
B3D3_B3D30_LENGTH                        equ 0001h
B3D3_B3D30_MASK                          equ 0001h
B3D3_B3D31_POSN                          equ 0001h
B3D3_B3D31_POSITION                      equ 0001h
B3D3_B3D31_SIZE                          equ 0001h
B3D3_B3D31_LENGTH                        equ 0001h
B3D3_B3D31_MASK                          equ 0002h
B3D3_B3D32_POSN                          equ 0002h
B3D3_B3D32_POSITION                      equ 0002h
B3D3_B3D32_SIZE                          equ 0001h
B3D3_B3D32_LENGTH                        equ 0001h
B3D3_B3D32_MASK                          equ 0004h
B3D3_B3D33_POSN                          equ 0003h
B3D3_B3D33_POSITION                      equ 0003h
B3D3_B3D33_SIZE                          equ 0001h
B3D3_B3D33_LENGTH                        equ 0001h
B3D3_B3D33_MASK                          equ 0008h
B3D3_B3D34_POSN                          equ 0004h
B3D3_B3D34_POSITION                      equ 0004h
B3D3_B3D34_SIZE                          equ 0001h
B3D3_B3D34_LENGTH                        equ 0001h
B3D3_B3D34_MASK                          equ 0010h
B3D3_B3D35_POSN                          equ 0005h
B3D3_B3D35_POSITION                      equ 0005h
B3D3_B3D35_SIZE                          equ 0001h
B3D3_B3D35_LENGTH                        equ 0001h
B3D3_B3D35_MASK                          equ 0020h
B3D3_B3D36_POSN                          equ 0006h
B3D3_B3D36_POSITION                      equ 0006h
B3D3_B3D36_SIZE                          equ 0001h
B3D3_B3D36_LENGTH                        equ 0001h
B3D3_B3D36_MASK                          equ 0040h
B3D3_B3D37_POSN                          equ 0007h
B3D3_B3D37_POSITION                      equ 0007h
B3D3_B3D37_SIZE                          equ 0001h
B3D3_B3D37_LENGTH                        equ 0001h
B3D3_B3D37_MASK                          equ 0080h

// Register: B3D4
#define B3D4 B3D4
B3D4                                     equ 0EBAh
// bitfield definitions
B3D4_B3D4_POSN                           equ 0000h
B3D4_B3D4_POSITION                       equ 0000h
B3D4_B3D4_SIZE                           equ 0008h
B3D4_B3D4_LENGTH                         equ 0008h
B3D4_B3D4_MASK                           equ 00FFh
B3D4_B3D40_POSN                          equ 0000h
B3D4_B3D40_POSITION                      equ 0000h
B3D4_B3D40_SIZE                          equ 0001h
B3D4_B3D40_LENGTH                        equ 0001h
B3D4_B3D40_MASK                          equ 0001h
B3D4_B3D41_POSN                          equ 0001h
B3D4_B3D41_POSITION                      equ 0001h
B3D4_B3D41_SIZE                          equ 0001h
B3D4_B3D41_LENGTH                        equ 0001h
B3D4_B3D41_MASK                          equ 0002h
B3D4_B3D42_POSN                          equ 0002h
B3D4_B3D42_POSITION                      equ 0002h
B3D4_B3D42_SIZE                          equ 0001h
B3D4_B3D42_LENGTH                        equ 0001h
B3D4_B3D42_MASK                          equ 0004h
B3D4_B3D43_POSN                          equ 0003h
B3D4_B3D43_POSITION                      equ 0003h
B3D4_B3D43_SIZE                          equ 0001h
B3D4_B3D43_LENGTH                        equ 0001h
B3D4_B3D43_MASK                          equ 0008h
B3D4_B3D44_POSN                          equ 0004h
B3D4_B3D44_POSITION                      equ 0004h
B3D4_B3D44_SIZE                          equ 0001h
B3D4_B3D44_LENGTH                        equ 0001h
B3D4_B3D44_MASK                          equ 0010h
B3D4_B3D45_POSN                          equ 0005h
B3D4_B3D45_POSITION                      equ 0005h
B3D4_B3D45_SIZE                          equ 0001h
B3D4_B3D45_LENGTH                        equ 0001h
B3D4_B3D45_MASK                          equ 0020h
B3D4_B3D46_POSN                          equ 0006h
B3D4_B3D46_POSITION                      equ 0006h
B3D4_B3D46_SIZE                          equ 0001h
B3D4_B3D46_LENGTH                        equ 0001h
B3D4_B3D46_MASK                          equ 0040h
B3D4_B3D47_POSN                          equ 0007h
B3D4_B3D47_POSITION                      equ 0007h
B3D4_B3D47_SIZE                          equ 0001h
B3D4_B3D47_LENGTH                        equ 0001h
B3D4_B3D47_MASK                          equ 0080h

// Register: B3D5
#define B3D5 B3D5
B3D5                                     equ 0EBBh
// bitfield definitions
B3D5_B3D5_POSN                           equ 0000h
B3D5_B3D5_POSITION                       equ 0000h
B3D5_B3D5_SIZE                           equ 0008h
B3D5_B3D5_LENGTH                         equ 0008h
B3D5_B3D5_MASK                           equ 00FFh
B3D5_B3D50_POSN                          equ 0000h
B3D5_B3D50_POSITION                      equ 0000h
B3D5_B3D50_SIZE                          equ 0001h
B3D5_B3D50_LENGTH                        equ 0001h
B3D5_B3D50_MASK                          equ 0001h
B3D5_B3D51_POSN                          equ 0001h
B3D5_B3D51_POSITION                      equ 0001h
B3D5_B3D51_SIZE                          equ 0001h
B3D5_B3D51_LENGTH                        equ 0001h
B3D5_B3D51_MASK                          equ 0002h
B3D5_B3D52_POSN                          equ 0002h
B3D5_B3D52_POSITION                      equ 0002h
B3D5_B3D52_SIZE                          equ 0001h
B3D5_B3D52_LENGTH                        equ 0001h
B3D5_B3D52_MASK                          equ 0004h
B3D5_B3D53_POSN                          equ 0003h
B3D5_B3D53_POSITION                      equ 0003h
B3D5_B3D53_SIZE                          equ 0001h
B3D5_B3D53_LENGTH                        equ 0001h
B3D5_B3D53_MASK                          equ 0008h
B3D5_B3D54_POSN                          equ 0004h
B3D5_B3D54_POSITION                      equ 0004h
B3D5_B3D54_SIZE                          equ 0001h
B3D5_B3D54_LENGTH                        equ 0001h
B3D5_B3D54_MASK                          equ 0010h
B3D5_B3D55_POSN                          equ 0005h
B3D5_B3D55_POSITION                      equ 0005h
B3D5_B3D55_SIZE                          equ 0001h
B3D5_B3D55_LENGTH                        equ 0001h
B3D5_B3D55_MASK                          equ 0020h
B3D5_B3D56_POSN                          equ 0006h
B3D5_B3D56_POSITION                      equ 0006h
B3D5_B3D56_SIZE                          equ 0001h
B3D5_B3D56_LENGTH                        equ 0001h
B3D5_B3D56_MASK                          equ 0040h
B3D5_B3D57_POSN                          equ 0007h
B3D5_B3D57_POSITION                      equ 0007h
B3D5_B3D57_SIZE                          equ 0001h
B3D5_B3D57_LENGTH                        equ 0001h
B3D5_B3D57_MASK                          equ 0080h

// Register: B3D6
#define B3D6 B3D6
B3D6                                     equ 0EBCh
// bitfield definitions
B3D6_B3D6_POSN                           equ 0000h
B3D6_B3D6_POSITION                       equ 0000h
B3D6_B3D6_SIZE                           equ 0008h
B3D6_B3D6_LENGTH                         equ 0008h
B3D6_B3D6_MASK                           equ 00FFh
B3D6_B3D60_POSN                          equ 0000h
B3D6_B3D60_POSITION                      equ 0000h
B3D6_B3D60_SIZE                          equ 0001h
B3D6_B3D60_LENGTH                        equ 0001h
B3D6_B3D60_MASK                          equ 0001h
B3D6_B3D61_POSN                          equ 0001h
B3D6_B3D61_POSITION                      equ 0001h
B3D6_B3D61_SIZE                          equ 0001h
B3D6_B3D61_LENGTH                        equ 0001h
B3D6_B3D61_MASK                          equ 0002h
B3D6_B3D62_POSN                          equ 0002h
B3D6_B3D62_POSITION                      equ 0002h
B3D6_B3D62_SIZE                          equ 0001h
B3D6_B3D62_LENGTH                        equ 0001h
B3D6_B3D62_MASK                          equ 0004h
B3D6_B3D63_POSN                          equ 0003h
B3D6_B3D63_POSITION                      equ 0003h
B3D6_B3D63_SIZE                          equ 0001h
B3D6_B3D63_LENGTH                        equ 0001h
B3D6_B3D63_MASK                          equ 0008h
B3D6_B3D64_POSN                          equ 0004h
B3D6_B3D64_POSITION                      equ 0004h
B3D6_B3D64_SIZE                          equ 0001h
B3D6_B3D64_LENGTH                        equ 0001h
B3D6_B3D64_MASK                          equ 0010h
B3D6_B3D65_POSN                          equ 0005h
B3D6_B3D65_POSITION                      equ 0005h
B3D6_B3D65_SIZE                          equ 0001h
B3D6_B3D65_LENGTH                        equ 0001h
B3D6_B3D65_MASK                          equ 0020h
B3D6_B3D66_POSN                          equ 0006h
B3D6_B3D66_POSITION                      equ 0006h
B3D6_B3D66_SIZE                          equ 0001h
B3D6_B3D66_LENGTH                        equ 0001h
B3D6_B3D66_MASK                          equ 0040h
B3D6_B3D67_POSN                          equ 0007h
B3D6_B3D67_POSITION                      equ 0007h
B3D6_B3D67_SIZE                          equ 0001h
B3D6_B3D67_LENGTH                        equ 0001h
B3D6_B3D67_MASK                          equ 0080h

// Register: B3D7
#define B3D7 B3D7
B3D7                                     equ 0EBDh
// bitfield definitions
B3D7_B3D7_POSN                           equ 0000h
B3D7_B3D7_POSITION                       equ 0000h
B3D7_B3D7_SIZE                           equ 0008h
B3D7_B3D7_LENGTH                         equ 0008h
B3D7_B3D7_MASK                           equ 00FFh
B3D7_B3D70_POSN                          equ 0000h
B3D7_B3D70_POSITION                      equ 0000h
B3D7_B3D70_SIZE                          equ 0001h
B3D7_B3D70_LENGTH                        equ 0001h
B3D7_B3D70_MASK                          equ 0001h
B3D7_B3D71_POSN                          equ 0001h
B3D7_B3D71_POSITION                      equ 0001h
B3D7_B3D71_SIZE                          equ 0001h
B3D7_B3D71_LENGTH                        equ 0001h
B3D7_B3D71_MASK                          equ 0002h
B3D7_B3D72_POSN                          equ 0002h
B3D7_B3D72_POSITION                      equ 0002h
B3D7_B3D72_SIZE                          equ 0001h
B3D7_B3D72_LENGTH                        equ 0001h
B3D7_B3D72_MASK                          equ 0004h
B3D7_B3D73_POSN                          equ 0003h
B3D7_B3D73_POSITION                      equ 0003h
B3D7_B3D73_SIZE                          equ 0001h
B3D7_B3D73_LENGTH                        equ 0001h
B3D7_B3D73_MASK                          equ 0008h
B3D7_B3D74_POSN                          equ 0004h
B3D7_B3D74_POSITION                      equ 0004h
B3D7_B3D74_SIZE                          equ 0001h
B3D7_B3D74_LENGTH                        equ 0001h
B3D7_B3D74_MASK                          equ 0010h
B3D7_B3D75_POSN                          equ 0005h
B3D7_B3D75_POSITION                      equ 0005h
B3D7_B3D75_SIZE                          equ 0001h
B3D7_B3D75_LENGTH                        equ 0001h
B3D7_B3D75_MASK                          equ 0020h
B3D7_B3D76_POSN                          equ 0006h
B3D7_B3D76_POSITION                      equ 0006h
B3D7_B3D76_SIZE                          equ 0001h
B3D7_B3D76_LENGTH                        equ 0001h
B3D7_B3D76_MASK                          equ 0040h
B3D7_B3D77_POSN                          equ 0007h
B3D7_B3D77_POSITION                      equ 0007h
B3D7_B3D77_SIZE                          equ 0001h
B3D7_B3D77_LENGTH                        equ 0001h
B3D7_B3D77_MASK                          equ 0080h

// Register: CANSTAT_RO6
#define CANSTAT_RO6 CANSTAT_RO6
CANSTAT_RO6                              equ 0EBEh
// bitfield definitions
CANSTAT_RO6_EICODE0_POSN                 equ 0000h
CANSTAT_RO6_EICODE0_POSITION             equ 0000h
CANSTAT_RO6_EICODE0_SIZE                 equ 0001h
CANSTAT_RO6_EICODE0_LENGTH               equ 0001h
CANSTAT_RO6_EICODE0_MASK                 equ 0001h
CANSTAT_RO6_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO6_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO6_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO6_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO6_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO6_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO6_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO6_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO6_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO6_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO6_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO6_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO6_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO6_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO6_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO6_EICODE4_POSN                 equ 0004h
CANSTAT_RO6_EICODE4_POSITION             equ 0004h
CANSTAT_RO6_EICODE4_SIZE                 equ 0001h
CANSTAT_RO6_EICODE4_LENGTH               equ 0001h
CANSTAT_RO6_EICODE4_MASK                 equ 0010h
CANSTAT_RO6_OPMODE_POSN                  equ 0005h
CANSTAT_RO6_OPMODE_POSITION              equ 0005h
CANSTAT_RO6_OPMODE_SIZE                  equ 0003h
CANSTAT_RO6_OPMODE_LENGTH                equ 0003h
CANSTAT_RO6_OPMODE_MASK                  equ 00E0h
CANSTAT_RO6_EICODE1_POSN                 equ 0001h
CANSTAT_RO6_EICODE1_POSITION             equ 0001h
CANSTAT_RO6_EICODE1_SIZE                 equ 0001h
CANSTAT_RO6_EICODE1_LENGTH               equ 0001h
CANSTAT_RO6_EICODE1_MASK                 equ 0002h
CANSTAT_RO6_EICODE2_POSN                 equ 0002h
CANSTAT_RO6_EICODE2_POSITION             equ 0002h
CANSTAT_RO6_EICODE2_SIZE                 equ 0001h
CANSTAT_RO6_EICODE2_LENGTH               equ 0001h
CANSTAT_RO6_EICODE2_MASK                 equ 0004h
CANSTAT_RO6_EICODE3_POSN                 equ 0003h
CANSTAT_RO6_EICODE3_POSITION             equ 0003h
CANSTAT_RO6_EICODE3_SIZE                 equ 0001h
CANSTAT_RO6_EICODE3_LENGTH               equ 0001h
CANSTAT_RO6_EICODE3_MASK                 equ 0008h
CANSTAT_RO6_OPMODE0_POSN                 equ 0005h
CANSTAT_RO6_OPMODE0_POSITION             equ 0005h
CANSTAT_RO6_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO6_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO6_OPMODE0_MASK                 equ 0020h
CANSTAT_RO6_OPMODE1_POSN                 equ 0006h
CANSTAT_RO6_OPMODE1_POSITION             equ 0006h
CANSTAT_RO6_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO6_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO6_OPMODE1_MASK                 equ 0040h
CANSTAT_RO6_OPMODE2_POSN                 equ 0007h
CANSTAT_RO6_OPMODE2_POSITION             equ 0007h
CANSTAT_RO6_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO6_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO6_OPMODE2_MASK                 equ 0080h
CANSTAT_RO6_ICODE0_POSN                  equ 0001h
CANSTAT_RO6_ICODE0_POSITION              equ 0001h
CANSTAT_RO6_ICODE0_SIZE                  equ 0001h
CANSTAT_RO6_ICODE0_LENGTH                equ 0001h
CANSTAT_RO6_ICODE0_MASK                  equ 0002h
CANSTAT_RO6_ICODE1_POSN                  equ 0002h
CANSTAT_RO6_ICODE1_POSITION              equ 0002h
CANSTAT_RO6_ICODE1_SIZE                  equ 0001h
CANSTAT_RO6_ICODE1_LENGTH                equ 0001h
CANSTAT_RO6_ICODE1_MASK                  equ 0004h
CANSTAT_RO6_ICODE2_POSN                  equ 0003h
CANSTAT_RO6_ICODE2_POSITION              equ 0003h
CANSTAT_RO6_ICODE2_SIZE                  equ 0001h
CANSTAT_RO6_ICODE2_LENGTH                equ 0001h
CANSTAT_RO6_ICODE2_MASK                  equ 0008h

