GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k80.inc
// Register: CANCON_RO4
#define CANCON_RO4 CANCON_RO4
CANCON_RO4                               equ 0EDFh
// bitfield definitions
CANCON_RO4_FP0_POSN                      equ 0000h
CANCON_RO4_FP0_POSITION                  equ 0000h
CANCON_RO4_FP0_SIZE                      equ 0001h
CANCON_RO4_FP0_LENGTH                    equ 0001h
CANCON_RO4_FP0_MASK                      equ 0001h
CANCON_RO4_WIN0_FP1_POSN                 equ 0001h
CANCON_RO4_WIN0_FP1_POSITION             equ 0001h
CANCON_RO4_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO4_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO4_WIN0_FP1_MASK                 equ 0002h
CANCON_RO4_WIN1_FP2_POSN                 equ 0002h
CANCON_RO4_WIN1_FP2_POSITION             equ 0002h
CANCON_RO4_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO4_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO4_WIN1_FP2_MASK                 equ 0004h
CANCON_RO4_WIN2_FP3_POSN                 equ 0003h
CANCON_RO4_WIN2_FP3_POSITION             equ 0003h
CANCON_RO4_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO4_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO4_WIN2_FP3_MASK                 equ 0008h
CANCON_RO4_ABAT_POSN                     equ 0004h
CANCON_RO4_ABAT_POSITION                 equ 0004h
CANCON_RO4_ABAT_SIZE                     equ 0001h
CANCON_RO4_ABAT_LENGTH                   equ 0001h
CANCON_RO4_ABAT_MASK                     equ 0010h
CANCON_RO4_REQOP_POSN                    equ 0005h
CANCON_RO4_REQOP_POSITION                equ 0005h
CANCON_RO4_REQOP_SIZE                    equ 0003h
CANCON_RO4_REQOP_LENGTH                  equ 0003h
CANCON_RO4_REQOP_MASK                    equ 00E0h
CANCON_RO4_WIN0_POSN                     equ 0001h
CANCON_RO4_WIN0_POSITION                 equ 0001h
CANCON_RO4_WIN0_SIZE                     equ 0001h
CANCON_RO4_WIN0_LENGTH                   equ 0001h
CANCON_RO4_WIN0_MASK                     equ 0002h
CANCON_RO4_WIN1_POSN                     equ 0002h
CANCON_RO4_WIN1_POSITION                 equ 0002h
CANCON_RO4_WIN1_SIZE                     equ 0001h
CANCON_RO4_WIN1_LENGTH                   equ 0001h
CANCON_RO4_WIN1_MASK                     equ 0004h
CANCON_RO4_WIN2_POSN                     equ 0003h
CANCON_RO4_WIN2_POSITION                 equ 0003h
CANCON_RO4_WIN2_SIZE                     equ 0001h
CANCON_RO4_WIN2_LENGTH                   equ 0001h
CANCON_RO4_WIN2_MASK                     equ 0008h
CANCON_RO4_FP1_POSN                      equ 0001h
CANCON_RO4_FP1_POSITION                  equ 0001h
CANCON_RO4_FP1_SIZE                      equ 0001h
CANCON_RO4_FP1_LENGTH                    equ 0001h
CANCON_RO4_FP1_MASK                      equ 0002h
CANCON_RO4_FP2_POSN                      equ 0002h
CANCON_RO4_FP2_POSITION                  equ 0002h
CANCON_RO4_FP2_SIZE                      equ 0001h
CANCON_RO4_FP2_LENGTH                    equ 0001h
CANCON_RO4_FP2_MASK                      equ 0004h
CANCON_RO4_FP3_POSN                      equ 0003h
CANCON_RO4_FP3_POSITION                  equ 0003h
CANCON_RO4_FP3_SIZE                      equ 0001h
CANCON_RO4_FP3_LENGTH                    equ 0001h
CANCON_RO4_FP3_MASK                      equ 0008h

// Register: RXF0SIDH
#define RXF0SIDH RXF0SIDH
RXF0SIDH                                 equ 0EE0h
// bitfield definitions
RXF0SIDH_SID_POSN                        equ 0000h
RXF0SIDH_SID_POSITION                    equ 0000h
RXF0SIDH_SID_SIZE                        equ 0008h
RXF0SIDH_SID_LENGTH                      equ 0008h
RXF0SIDH_SID_MASK                        equ 00FFh
RXF0SIDH_SID3_POSN                       equ 0000h
RXF0SIDH_SID3_POSITION                   equ 0000h
RXF0SIDH_SID3_SIZE                       equ 0001h
RXF0SIDH_SID3_LENGTH                     equ 0001h
RXF0SIDH_SID3_MASK                       equ 0001h
RXF0SIDH_SID4_POSN                       equ 0001h
RXF0SIDH_SID4_POSITION                   equ 0001h
RXF0SIDH_SID4_SIZE                       equ 0001h
RXF0SIDH_SID4_LENGTH                     equ 0001h
RXF0SIDH_SID4_MASK                       equ 0002h
RXF0SIDH_SID5_POSN                       equ 0002h
RXF0SIDH_SID5_POSITION                   equ 0002h
RXF0SIDH_SID5_SIZE                       equ 0001h
RXF0SIDH_SID5_LENGTH                     equ 0001h
RXF0SIDH_SID5_MASK                       equ 0004h
RXF0SIDH_SID6_POSN                       equ 0003h
RXF0SIDH_SID6_POSITION                   equ 0003h
RXF0SIDH_SID6_SIZE                       equ 0001h
RXF0SIDH_SID6_LENGTH                     equ 0001h
RXF0SIDH_SID6_MASK                       equ 0008h
RXF0SIDH_SID7_POSN                       equ 0004h
RXF0SIDH_SID7_POSITION                   equ 0004h
RXF0SIDH_SID7_SIZE                       equ 0001h
RXF0SIDH_SID7_LENGTH                     equ 0001h
RXF0SIDH_SID7_MASK                       equ 0010h
RXF0SIDH_SID8_POSN                       equ 0005h
RXF0SIDH_SID8_POSITION                   equ 0005h
RXF0SIDH_SID8_SIZE                       equ 0001h
RXF0SIDH_SID8_LENGTH                     equ 0001h
RXF0SIDH_SID8_MASK                       equ 0020h
RXF0SIDH_SID9_POSN                       equ 0006h
RXF0SIDH_SID9_POSITION                   equ 0006h
RXF0SIDH_SID9_SIZE                       equ 0001h
RXF0SIDH_SID9_LENGTH                     equ 0001h
RXF0SIDH_SID9_MASK                       equ 0040h
RXF0SIDH_SID10_POSN                      equ 0007h
RXF0SIDH_SID10_POSITION                  equ 0007h
RXF0SIDH_SID10_SIZE                      equ 0001h
RXF0SIDH_SID10_LENGTH                    equ 0001h
RXF0SIDH_SID10_MASK                      equ 0080h
RXF0SIDH_RXF0SID3_POSN                   equ 0000h
RXF0SIDH_RXF0SID3_POSITION               equ 0000h
RXF0SIDH_RXF0SID3_SIZE                   equ 0001h
RXF0SIDH_RXF0SID3_LENGTH                 equ 0001h
RXF0SIDH_RXF0SID3_MASK                   equ 0001h
RXF0SIDH_RXF0SID4_POSN                   equ 0001h
RXF0SIDH_RXF0SID4_POSITION               equ 0001h
RXF0SIDH_RXF0SID4_SIZE                   equ 0001h
RXF0SIDH_RXF0SID4_LENGTH                 equ 0001h
RXF0SIDH_RXF0SID4_MASK                   equ 0002h
RXF0SIDH_RXF0SID5_POSN                   equ 0002h
RXF0SIDH_RXF0SID5_POSITION               equ 0002h
RXF0SIDH_RXF0SID5_SIZE                   equ 0001h
RXF0SIDH_RXF0SID5_LENGTH                 equ 0001h
RXF0SIDH_RXF0SID5_MASK                   equ 0004h
RXF0SIDH_RXF0SID6_POSN                   equ 0003h
RXF0SIDH_RXF0SID6_POSITION               equ 0003h
RXF0SIDH_RXF0SID6_SIZE                   equ 0001h
RXF0SIDH_RXF0SID6_LENGTH                 equ 0001h
RXF0SIDH_RXF0SID6_MASK                   equ 0008h
RXF0SIDH_RXF0SID7_POSN                   equ 0004h
RXF0SIDH_RXF0SID7_POSITION               equ 0004h
RXF0SIDH_RXF0SID7_SIZE                   equ 0001h
RXF0SIDH_RXF0SID7_LENGTH                 equ 0001h
RXF0SIDH_RXF0SID7_MASK                   equ 0010h
RXF0SIDH_RXF0SID8_POSN                   equ 0005h
RXF0SIDH_RXF0SID8_POSITION               equ 0005h
RXF0SIDH_RXF0SID8_SIZE                   equ 0001h
RXF0SIDH_RXF0SID8_LENGTH                 equ 0001h
RXF0SIDH_RXF0SID8_MASK                   equ 0020h
RXF0SIDH_RXF0SID9_POSN                   equ 0006h
RXF0SIDH_RXF0SID9_POSITION               equ 0006h
RXF0SIDH_RXF0SID9_SIZE                   equ 0001h
RXF0SIDH_RXF0SID9_LENGTH                 equ 0001h
RXF0SIDH_RXF0SID9_MASK                   equ 0040h
RXF0SIDH_RXF0SID10_POSN                  equ 0007h
RXF0SIDH_RXF0SID10_POSITION              equ 0007h
RXF0SIDH_RXF0SID10_SIZE                  equ 0001h
RXF0SIDH_RXF0SID10_LENGTH                equ 0001h
RXF0SIDH_RXF0SID10_MASK                  equ 0080h

// Register: RXF0SIDL
#define RXF0SIDL RXF0SIDL
RXF0SIDL                                 equ 0EE1h
// bitfield definitions
RXF0SIDL_EID_POSN                        equ 0000h
RXF0SIDL_EID_POSITION                    equ 0000h
RXF0SIDL_EID_SIZE                        equ 0002h
RXF0SIDL_EID_LENGTH                      equ 0002h
RXF0SIDL_EID_MASK                        equ 0003h
RXF0SIDL_EXIDEN_POSN                     equ 0003h
RXF0SIDL_EXIDEN_POSITION                 equ 0003h
RXF0SIDL_EXIDEN_SIZE                     equ 0001h
RXF0SIDL_EXIDEN_LENGTH                   equ 0001h
RXF0SIDL_EXIDEN_MASK                     equ 0008h
RXF0SIDL_SID_POSN                        equ 0005h
RXF0SIDL_SID_POSITION                    equ 0005h
RXF0SIDL_SID_SIZE                        equ 0003h
RXF0SIDL_SID_LENGTH                      equ 0003h
RXF0SIDL_SID_MASK                        equ 00E0h
RXF0SIDL_EID16_POSN                      equ 0000h
RXF0SIDL_EID16_POSITION                  equ 0000h
RXF0SIDL_EID16_SIZE                      equ 0001h
RXF0SIDL_EID16_LENGTH                    equ 0001h
RXF0SIDL_EID16_MASK                      equ 0001h
RXF0SIDL_EID17_POSN                      equ 0001h
RXF0SIDL_EID17_POSITION                  equ 0001h
RXF0SIDL_EID17_SIZE                      equ 0001h
RXF0SIDL_EID17_LENGTH                    equ 0001h
RXF0SIDL_EID17_MASK                      equ 0002h
RXF0SIDL_SID0_POSN                       equ 0005h
RXF0SIDL_SID0_POSITION                   equ 0005h
RXF0SIDL_SID0_SIZE                       equ 0001h
RXF0SIDL_SID0_LENGTH                     equ 0001h
RXF0SIDL_SID0_MASK                       equ 0020h
RXF0SIDL_SID1_POSN                       equ 0006h
RXF0SIDL_SID1_POSITION                   equ 0006h
RXF0SIDL_SID1_SIZE                       equ 0001h
RXF0SIDL_SID1_LENGTH                     equ 0001h
RXF0SIDL_SID1_MASK                       equ 0040h
RXF0SIDL_SID2_POSN                       equ 0007h
RXF0SIDL_SID2_POSITION                   equ 0007h
RXF0SIDL_SID2_SIZE                       equ 0001h
RXF0SIDL_SID2_LENGTH                     equ 0001h
RXF0SIDL_SID2_MASK                       equ 0080h
RXF0SIDL_RXF0EID16_POSN                  equ 0000h
RXF0SIDL_RXF0EID16_POSITION              equ 0000h
RXF0SIDL_RXF0EID16_SIZE                  equ 0001h
RXF0SIDL_RXF0EID16_LENGTH                equ 0001h
RXF0SIDL_RXF0EID16_MASK                  equ 0001h
RXF0SIDL_RXF0EID17_POSN                  equ 0001h
RXF0SIDL_RXF0EID17_POSITION              equ 0001h
RXF0SIDL_RXF0EID17_SIZE                  equ 0001h
RXF0SIDL_RXF0EID17_LENGTH                equ 0001h
RXF0SIDL_RXF0EID17_MASK                  equ 0002h
RXF0SIDL_RXF0EXIDEN_POSN                 equ 0003h
RXF0SIDL_RXF0EXIDEN_POSITION             equ 0003h
RXF0SIDL_RXF0EXIDEN_SIZE                 equ 0001h
RXF0SIDL_RXF0EXIDEN_LENGTH               equ 0001h
RXF0SIDL_RXF0EXIDEN_MASK                 equ 0008h
RXF0SIDL_RXF0SID0_POSN                   equ 0005h
RXF0SIDL_RXF0SID0_POSITION               equ 0005h
RXF0SIDL_RXF0SID0_SIZE                   equ 0001h
RXF0SIDL_RXF0SID0_LENGTH                 equ 0001h
RXF0SIDL_RXF0SID0_MASK                   equ 0020h
RXF0SIDL_RXF0SID1_POSN                   equ 0006h
RXF0SIDL_RXF0SID1_POSITION               equ 0006h
RXF0SIDL_RXF0SID1_SIZE                   equ 0001h
RXF0SIDL_RXF0SID1_LENGTH                 equ 0001h
RXF0SIDL_RXF0SID1_MASK                   equ 0040h
RXF0SIDL_RXF0SID2_POSN                   equ 0007h
RXF0SIDL_RXF0SID2_POSITION               equ 0007h
RXF0SIDL_RXF0SID2_SIZE                   equ 0001h
RXF0SIDL_RXF0SID2_LENGTH                 equ 0001h
RXF0SIDL_RXF0SID2_MASK                   equ 0080h

// Register: RXF0EIDH
#define RXF0EIDH RXF0EIDH
RXF0EIDH                                 equ 0EE2h
// bitfield definitions
RXF0EIDH_EID_POSN                        equ 0000h
RXF0EIDH_EID_POSITION                    equ 0000h
RXF0EIDH_EID_SIZE                        equ 0008h
RXF0EIDH_EID_LENGTH                      equ 0008h
RXF0EIDH_EID_MASK                        equ 00FFh
RXF0EIDH_EID8_POSN                       equ 0000h
RXF0EIDH_EID8_POSITION                   equ 0000h
RXF0EIDH_EID8_SIZE                       equ 0001h
RXF0EIDH_EID8_LENGTH                     equ 0001h
RXF0EIDH_EID8_MASK                       equ 0001h
RXF0EIDH_EID9_POSN                       equ 0001h
RXF0EIDH_EID9_POSITION                   equ 0001h
RXF0EIDH_EID9_SIZE                       equ 0001h
RXF0EIDH_EID9_LENGTH                     equ 0001h
RXF0EIDH_EID9_MASK                       equ 0002h
RXF0EIDH_EID10_POSN                      equ 0002h
RXF0EIDH_EID10_POSITION                  equ 0002h
RXF0EIDH_EID10_SIZE                      equ 0001h
RXF0EIDH_EID10_LENGTH                    equ 0001h
RXF0EIDH_EID10_MASK                      equ 0004h
RXF0EIDH_EID11_POSN                      equ 0003h
RXF0EIDH_EID11_POSITION                  equ 0003h
RXF0EIDH_EID11_SIZE                      equ 0001h
RXF0EIDH_EID11_LENGTH                    equ 0001h
RXF0EIDH_EID11_MASK                      equ 0008h
RXF0EIDH_EID12_POSN                      equ 0004h
RXF0EIDH_EID12_POSITION                  equ 0004h
RXF0EIDH_EID12_SIZE                      equ 0001h
RXF0EIDH_EID12_LENGTH                    equ 0001h
RXF0EIDH_EID12_MASK                      equ 0010h
RXF0EIDH_EID13_POSN                      equ 0005h
RXF0EIDH_EID13_POSITION                  equ 0005h
RXF0EIDH_EID13_SIZE                      equ 0001h
RXF0EIDH_EID13_LENGTH                    equ 0001h
RXF0EIDH_EID13_MASK                      equ 0020h
RXF0EIDH_EID14_POSN                      equ 0006h
RXF0EIDH_EID14_POSITION                  equ 0006h
RXF0EIDH_EID14_SIZE                      equ 0001h
RXF0EIDH_EID14_LENGTH                    equ 0001h
RXF0EIDH_EID14_MASK                      equ 0040h
RXF0EIDH_EID15_POSN                      equ 0007h
RXF0EIDH_EID15_POSITION                  equ 0007h
RXF0EIDH_EID15_SIZE                      equ 0001h
RXF0EIDH_EID15_LENGTH                    equ 0001h
RXF0EIDH_EID15_MASK                      equ 0080h
RXF0EIDH_RXF0EID8_POSN                   equ 0000h
RXF0EIDH_RXF0EID8_POSITION               equ 0000h
RXF0EIDH_RXF0EID8_SIZE                   equ 0001h
RXF0EIDH_RXF0EID8_LENGTH                 equ 0001h
RXF0EIDH_RXF0EID8_MASK                   equ 0001h
RXF0EIDH_RXF0EID9_POSN                   equ 0001h
RXF0EIDH_RXF0EID9_POSITION               equ 0001h
RXF0EIDH_RXF0EID9_SIZE                   equ 0001h
RXF0EIDH_RXF0EID9_LENGTH                 equ 0001h
RXF0EIDH_RXF0EID9_MASK                   equ 0002h
RXF0EIDH_RXF0EID10_POSN                  equ 0002h
RXF0EIDH_RXF0EID10_POSITION              equ 0002h
RXF0EIDH_RXF0EID10_SIZE                  equ 0001h
RXF0EIDH_RXF0EID10_LENGTH                equ 0001h
RXF0EIDH_RXF0EID10_MASK                  equ 0004h
RXF0EIDH_RXF0EID11_POSN                  equ 0003h
RXF0EIDH_RXF0EID11_POSITION              equ 0003h
RXF0EIDH_RXF0EID11_SIZE                  equ 0001h
RXF0EIDH_RXF0EID11_LENGTH                equ 0001h
RXF0EIDH_RXF0EID11_MASK                  equ 0008h
RXF0EIDH_RXF0EID12_POSN                  equ 0004h
RXF0EIDH_RXF0EID12_POSITION              equ 0004h
RXF0EIDH_RXF0EID12_SIZE                  equ 0001h
RXF0EIDH_RXF0EID12_LENGTH                equ 0001h
RXF0EIDH_RXF0EID12_MASK                  equ 0010h
RXF0EIDH_RXF0EID13_POSN                  equ 0005h
RXF0EIDH_RXF0EID13_POSITION              equ 0005h
RXF0EIDH_RXF0EID13_SIZE                  equ 0001h
RXF0EIDH_RXF0EID13_LENGTH                equ 0001h
RXF0EIDH_RXF0EID13_MASK                  equ 0020h
RXF0EIDH_RXF0EID14_POSN                  equ 0006h
RXF0EIDH_RXF0EID14_POSITION              equ 0006h
RXF0EIDH_RXF0EID14_SIZE                  equ 0001h
RXF0EIDH_RXF0EID14_LENGTH                equ 0001h
RXF0EIDH_RXF0EID14_MASK                  equ 0040h
RXF0EIDH_RXF0EID15_POSN                  equ 0007h
RXF0EIDH_RXF0EID15_POSITION              equ 0007h
RXF0EIDH_RXF0EID15_SIZE                  equ 0001h
RXF0EIDH_RXF0EID15_LENGTH                equ 0001h
RXF0EIDH_RXF0EID15_MASK                  equ 0080h

// Register: RXF0EIDL
#define RXF0EIDL RXF0EIDL
RXF0EIDL                                 equ 0EE3h
// bitfield definitions
RXF0EIDL_EID_POSN                        equ 0000h
RXF0EIDL_EID_POSITION                    equ 0000h
RXF0EIDL_EID_SIZE                        equ 0008h
RXF0EIDL_EID_LENGTH                      equ 0008h
RXF0EIDL_EID_MASK                        equ 00FFh
RXF0EIDL_EID0_POSN                       equ 0000h
RXF0EIDL_EID0_POSITION                   equ 0000h
RXF0EIDL_EID0_SIZE                       equ 0001h
RXF0EIDL_EID0_LENGTH                     equ 0001h
RXF0EIDL_EID0_MASK                       equ 0001h
RXF0EIDL_EID1_POSN                       equ 0001h
RXF0EIDL_EID1_POSITION                   equ 0001h
RXF0EIDL_EID1_SIZE                       equ 0001h
RXF0EIDL_EID1_LENGTH                     equ 0001h
RXF0EIDL_EID1_MASK                       equ 0002h
RXF0EIDL_EID2_POSN                       equ 0002h
RXF0EIDL_EID2_POSITION                   equ 0002h
RXF0EIDL_EID2_SIZE                       equ 0001h
RXF0EIDL_EID2_LENGTH                     equ 0001h
RXF0EIDL_EID2_MASK                       equ 0004h
RXF0EIDL_EID3_POSN                       equ 0003h
RXF0EIDL_EID3_POSITION                   equ 0003h
RXF0EIDL_EID3_SIZE                       equ 0001h
RXF0EIDL_EID3_LENGTH                     equ 0001h
RXF0EIDL_EID3_MASK                       equ 0008h
RXF0EIDL_EID4_POSN                       equ 0004h
RXF0EIDL_EID4_POSITION                   equ 0004h
RXF0EIDL_EID4_SIZE                       equ 0001h
RXF0EIDL_EID4_LENGTH                     equ 0001h
RXF0EIDL_EID4_MASK                       equ 0010h
RXF0EIDL_EID5_POSN                       equ 0005h
RXF0EIDL_EID5_POSITION                   equ 0005h
RXF0EIDL_EID5_SIZE                       equ 0001h
RXF0EIDL_EID5_LENGTH                     equ 0001h
RXF0EIDL_EID5_MASK                       equ 0020h
RXF0EIDL_EID6_POSN                       equ 0006h
RXF0EIDL_EID6_POSITION                   equ 0006h
RXF0EIDL_EID6_SIZE                       equ 0001h
RXF0EIDL_EID6_LENGTH                     equ 0001h
RXF0EIDL_EID6_MASK                       equ 0040h
RXF0EIDL_EID7_POSN                       equ 0007h
RXF0EIDL_EID7_POSITION                   equ 0007h
RXF0EIDL_EID7_SIZE                       equ 0001h
RXF0EIDL_EID7_LENGTH                     equ 0001h
RXF0EIDL_EID7_MASK                       equ 0080h
RXF0EIDL_RXF0EID0_POSN                   equ 0000h
RXF0EIDL_RXF0EID0_POSITION               equ 0000h
RXF0EIDL_RXF0EID0_SIZE                   equ 0001h
RXF0EIDL_RXF0EID0_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID0_MASK                   equ 0001h
RXF0EIDL_RXF0EID1_POSN                   equ 0001h
RXF0EIDL_RXF0EID1_POSITION               equ 0001h
RXF0EIDL_RXF0EID1_SIZE                   equ 0001h
RXF0EIDL_RXF0EID1_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID1_MASK                   equ 0002h
RXF0EIDL_RXF0EID2_POSN                   equ 0002h
RXF0EIDL_RXF0EID2_POSITION               equ 0002h
RXF0EIDL_RXF0EID2_SIZE                   equ 0001h
RXF0EIDL_RXF0EID2_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID2_MASK                   equ 0004h
RXF0EIDL_RXF0EID3_POSN                   equ 0003h
RXF0EIDL_RXF0EID3_POSITION               equ 0003h
RXF0EIDL_RXF0EID3_SIZE                   equ 0001h
RXF0EIDL_RXF0EID3_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID3_MASK                   equ 0008h
RXF0EIDL_RXF0EID4_POSN                   equ 0004h
RXF0EIDL_RXF0EID4_POSITION               equ 0004h
RXF0EIDL_RXF0EID4_SIZE                   equ 0001h
RXF0EIDL_RXF0EID4_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID4_MASK                   equ 0010h
RXF0EIDL_RXF0EID5_POSN                   equ 0005h
RXF0EIDL_RXF0EID5_POSITION               equ 0005h
RXF0EIDL_RXF0EID5_SIZE                   equ 0001h
RXF0EIDL_RXF0EID5_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID5_MASK                   equ 0020h
RXF0EIDL_RXF0EID6_POSN                   equ 0006h
RXF0EIDL_RXF0EID6_POSITION               equ 0006h
RXF0EIDL_RXF0EID6_SIZE                   equ 0001h
RXF0EIDL_RXF0EID6_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID6_MASK                   equ 0040h
RXF0EIDL_RXF0EID7_POSN                   equ 0007h
RXF0EIDL_RXF0EID7_POSITION               equ 0007h
RXF0EIDL_RXF0EID7_SIZE                   equ 0001h
RXF0EIDL_RXF0EID7_LENGTH                 equ 0001h
RXF0EIDL_RXF0EID7_MASK                   equ 0080h

