GopalSaraf/Practicals/PSDL/include/proc/pic18lf45k80.inc
// Register: CTMUCONH
#define CTMUCONH CTMUCONH
CTMUCONH                                 equ 0F55h
// bitfield definitions
CTMUCONH_CTTRIG_POSN                     equ 0000h
CTMUCONH_CTTRIG_POSITION                 equ 0000h
CTMUCONH_CTTRIG_SIZE                     equ 0001h
CTMUCONH_CTTRIG_LENGTH                   equ 0001h
CTMUCONH_CTTRIG_MASK                     equ 0001h
CTMUCONH_IDISSEN_POSN                    equ 0001h
CTMUCONH_IDISSEN_POSITION                equ 0001h
CTMUCONH_IDISSEN_SIZE                    equ 0001h
CTMUCONH_IDISSEN_LENGTH                  equ 0001h
CTMUCONH_IDISSEN_MASK                    equ 0002h
CTMUCONH_EDGSEQEN_POSN                   equ 0002h
CTMUCONH_EDGSEQEN_POSITION               equ 0002h
CTMUCONH_EDGSEQEN_SIZE                   equ 0001h
CTMUCONH_EDGSEQEN_LENGTH                 equ 0001h
CTMUCONH_EDGSEQEN_MASK                   equ 0004h
CTMUCONH_EDGEN_POSN                      equ 0003h
CTMUCONH_EDGEN_POSITION                  equ 0003h
CTMUCONH_EDGEN_SIZE                      equ 0001h
CTMUCONH_EDGEN_LENGTH                    equ 0001h
CTMUCONH_EDGEN_MASK                      equ 0008h
CTMUCONH_TGEN_POSN                       equ 0004h
CTMUCONH_TGEN_POSITION                   equ 0004h
CTMUCONH_TGEN_SIZE                       equ 0001h
CTMUCONH_TGEN_LENGTH                     equ 0001h
CTMUCONH_TGEN_MASK                       equ 0010h
CTMUCONH_CTMUSIDL_POSN                   equ 0005h
CTMUCONH_CTMUSIDL_POSITION               equ 0005h
CTMUCONH_CTMUSIDL_SIZE                   equ 0001h
CTMUCONH_CTMUSIDL_LENGTH                 equ 0001h
CTMUCONH_CTMUSIDL_MASK                   equ 0020h
CTMUCONH_CTMUEN_POSN                     equ 0007h
CTMUCONH_CTMUEN_POSITION                 equ 0007h
CTMUCONH_CTMUEN_SIZE                     equ 0001h
CTMUCONH_CTMUEN_LENGTH                   equ 0001h
CTMUCONH_CTMUEN_MASK                     equ 0080h

// Register: PADCFG1
#define PADCFG1 PADCFG1
PADCFG1                                  equ 0F56h
// bitfield definitions
PADCFG1_CTMUDS_POSN                      equ 0000h
PADCFG1_CTMUDS_POSITION                  equ 0000h
PADCFG1_CTMUDS_SIZE                      equ 0001h
PADCFG1_CTMUDS_LENGTH                    equ 0001h
PADCFG1_CTMUDS_MASK                      equ 0001h
PADCFG1_REPU_POSN                        equ 0006h
PADCFG1_REPU_POSITION                    equ 0006h
PADCFG1_REPU_SIZE                        equ 0001h
PADCFG1_REPU_LENGTH                      equ 0001h
PADCFG1_REPU_MASK                        equ 0040h
PADCFG1_RDPU_POSN                        equ 0007h
PADCFG1_RDPU_POSITION                    equ 0007h
PADCFG1_RDPU_SIZE                        equ 0001h
PADCFG1_RDPU_LENGTH                      equ 0001h
PADCFG1_RDPU_MASK                        equ 0080h
PADCFG1_PMPTTL_POSN                      equ 0000h
PADCFG1_PMPTTL_POSITION                  equ 0000h
PADCFG1_PMPTTL_SIZE                      equ 0001h
PADCFG1_PMPTTL_LENGTH                    equ 0001h
PADCFG1_PMPTTL_MASK                      equ 0001h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0F57h
// bitfield definitions
PMD2_CMP1MD_POSN                         equ 0000h
PMD2_CMP1MD_POSITION                     equ 0000h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0001h
PMD2_CMP2MD_POSN                         equ 0001h
PMD2_CMP2MD_POSITION                     equ 0001h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0002h
PMD2_ECANMD_POSN                         equ 0002h
PMD2_ECANMD_POSITION                     equ 0002h
PMD2_ECANMD_SIZE                         equ 0001h
PMD2_ECANMD_LENGTH                       equ 0001h
PMD2_ECANMD_MASK                         equ 0004h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 0F58h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_ADCMD_POSN                          equ 0005h
PMD1_ADCMD_POSITION                      equ 0005h
PMD1_ADCMD_SIZE                          equ 0001h
PMD1_ADCMD_LENGTH                        equ 0001h
PMD1_ADCMD_MASK                          equ 0020h
PMD1_CTMUMD_POSN                         equ 0006h
PMD1_CTMUMD_POSITION                     equ 0006h
PMD1_CTMUMD_SIZE                         equ 0001h
PMD1_CTMUMD_LENGTH                       equ 0001h
PMD1_CTMUMD_MASK                         equ 0040h
PMD1_PSPMD_POSN                          equ 0007h
PMD1_PSPMD_POSITION                      equ 0007h
PMD1_PSPMD_SIZE                          equ 0001h
PMD1_PSPMD_LENGTH                        equ 0001h
PMD1_PSPMD_MASK                          equ 0080h
PMD1_EMBMD_POSN                          equ 0000h
PMD1_EMBMD_POSITION                      equ 0000h
PMD1_EMBMD_SIZE                          equ 0001h
PMD1_EMBMD_LENGTH                        equ 0001h
PMD1_EMBMD_MASK                          equ 0001h

